nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_tpm.h
/*! @brief Read current value of the TPM_POL_POL2 field. */
#define BR_TPM_POL_POL2(x)   (BME_UBFX32(HW_TPM_POL_ADDR(x), BP_TPM_POL_POL2, BS_TPM_POL_POL2))

/*! @brief Format value for bitfield TPM_POL_POL2. */
#define BF_TPM_POL_POL2(v)   ((uint32_t)((uint32_t)(v) << BP_TPM_POL_POL2) & BM_TPM_POL_POL2)

/*! @brief Set the POL2 field to a new value. */
#define BW_TPM_POL_POL2(x, v) (BME_BFI32(HW_TPM_POL_ADDR(x), ((uint32_t)(v) << BP_TPM_POL_POL2), BP_TPM_POL_POL2, 1))
/*@}*/

/*!
 * @name Register TPM_POL, field POL3[3] (RW)
 *
 * Values:
 * - 0 - The channel polarity is active high.
 * - 1 - The channel polarity is active low.
 */
/*@{*/
#define BP_TPM_POL_POL3      (3U)          /*!< Bit position for TPM_POL_POL3. */
#define BM_TPM_POL_POL3      (0x00000008U) /*!< Bit mask for TPM_POL_POL3. */
#define BS_TPM_POL_POL3      (1U)          /*!< Bit field size in bits for TPM_POL_POL3. */

/*! @brief Read current value of the TPM_POL_POL3 field. */
#define BR_TPM_POL_POL3(x)   (BME_UBFX32(HW_TPM_POL_ADDR(x), BP_TPM_POL_POL3, BS_TPM_POL_POL3))

/*! @brief Format value for bitfield TPM_POL_POL3. */
#define BF_TPM_POL_POL3(v)   ((uint32_t)((uint32_t)(v) << BP_TPM_POL_POL3) & BM_TPM_POL_POL3)

/*! @brief Set the POL3 field to a new value. */
#define BW_TPM_POL_POL3(x, v) (BME_BFI32(HW_TPM_POL_ADDR(x), ((uint32_t)(v) << BP_TPM_POL_POL3), BP_TPM_POL_POL3, 1))
/*@}*/

/*!
 * @name Register TPM_POL, field POL4[4] (RW)
 *
 * Values:
 * - 0 - The channel polarity is active high
 * - 1 - The channel polarity is active low.
 */
/*@{*/
#define BP_TPM_POL_POL4      (4U)          /*!< Bit position for TPM_POL_POL4. */
#define BM_TPM_POL_POL4      (0x00000010U) /*!< Bit mask for TPM_POL_POL4. */
#define BS_TPM_POL_POL4      (1U)          /*!< Bit field size in bits for TPM_POL_POL4. */

/*! @brief Read current value of the TPM_POL_POL4 field. */
#define BR_TPM_POL_POL4(x)   (BME_UBFX32(HW_TPM_POL_ADDR(x), BP_TPM_POL_POL4, BS_TPM_POL_POL4))

/*! @brief Format value for bitfield TPM_POL_POL4. */
#define BF_TPM_POL_POL4(v)   ((uint32_t)((uint32_t)(v) << BP_TPM_POL_POL4) & BM_TPM_POL_POL4)

/*! @brief Set the POL4 field to a new value. */
#define BW_TPM_POL_POL4(x, v) (BME_BFI32(HW_TPM_POL_ADDR(x), ((uint32_t)(v) << BP_TPM_POL_POL4), BP_TPM_POL_POL4, 1))
/*@}*/

/*!
 * @name Register TPM_POL, field POL5[5] (RW)
 *
 * Values:
 * - 0 - The channel polarity is active high.
 * - 1 - The channel polarity is active low.
 */
/*@{*/
#define BP_TPM_POL_POL5      (5U)          /*!< Bit position for TPM_POL_POL5. */
#define BM_TPM_POL_POL5      (0x00000020U) /*!< Bit mask for TPM_POL_POL5. */
#define BS_TPM_POL_POL5      (1U)          /*!< Bit field size in bits for TPM_POL_POL5. */

/*! @brief Read current value of the TPM_POL_POL5 field. */
#define BR_TPM_POL_POL5(x)   (BME_UBFX32(HW_TPM_POL_ADDR(x), BP_TPM_POL_POL5, BS_TPM_POL_POL5))

/*! @brief Format value for bitfield TPM_POL_POL5. */
#define BF_TPM_POL_POL5(v)   ((uint32_t)((uint32_t)(v) << BP_TPM_POL_POL5) & BM_TPM_POL_POL5)

/*! @brief Set the POL5 field to a new value. */
#define BW_TPM_POL_POL5(x, v) (BME_BFI32(HW_TPM_POL_ADDR(x), ((uint32_t)(v) << BP_TPM_POL_POL5), BP_TPM_POL_POL5, 1))
/*@}*/

/*******************************************************************************
 * HW_TPM_CONF - Configuration
 ******************************************************************************/

/*!
 * @brief HW_TPM_CONF - Configuration (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register selects the behavior in debug and wait modes and the use of an
 * external global time base.
 */
typedef union _hw_tpm_conf
{
    uint32_t U;
    struct _hw_tpm_conf_bitfields
    {
        uint32_t RESERVED0 : 5;        /*!< [4:0]  */
        uint32_t DOZEEN : 1;           /*!< [5] Doze Enable */
        uint32_t DBGMODE : 2;          /*!< [7:6] Debug Mode */
        uint32_t GTBSYNC : 1;          /*!< [8] Global Time Base Synchronization */
        uint32_t GTBEEN : 1;           /*!< [9] Global time base enable */
        uint32_t RESERVED1 : 6;        /*!< [15:10]  */
        uint32_t CSOT : 1;             /*!< [16] Counter Start on Trigger */
        uint32_t CSOO : 1;             /*!< [17] Counter Stop On Overflow */
        uint32_t CROT : 1;             /*!< [18] Counter Reload On Trigger */
        uint32_t CPOT : 1;             /*!< [19] Counter Pause On Trigger */
        uint32_t RESERVED2 : 2;        /*!< [21:20]  */
        uint32_t TRGPOL : 1;           /*!< [22] Trigger Polarity */
        uint32_t TRGSRC : 1;           /*!< [23] Trigger Source */
        uint32_t TRGSEL : 4;           /*!< [27:24] Trigger Select */
        uint32_t RESERVED3 : 4;        /*!< [31:28]  */
    } B;
} hw_tpm_conf_t;

/*!
 * @name Constants and macros for entire TPM_CONF register
 */
/*@{*/
#define HW_TPM_CONF_ADDR(x)      ((x) + 0x84U)

#define HW_TPM_CONF(x)           (*(__IO hw_tpm_conf_t *) HW_TPM_CONF_ADDR(x))
#define HW_TPM_CONF_RD(x)        (HW_TPM_CONF(x).U)
#define HW_TPM_CONF_WR(x, v)     (HW_TPM_CONF(x).U = (v))
#define HW_TPM_CONF_SET(x, v)    (BME_OR32(HW_TPM_CONF_ADDR(x), (uint32_t)(v)))
#define HW_TPM_CONF_CLR(x, v)    (BME_AND32(HW_TPM_CONF_ADDR(x), (uint32_t)(~(v))))
#define HW_TPM_CONF_TOG(x, v)    (BME_XOR32(HW_TPM_CONF_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual TPM_CONF bitfields
 */

/*!
 * @name Register TPM_CONF, field DOZEEN[5] (RW)
 *
 * Configures the TPM behavior in wait mode.
 *
 * Values:
 * - 0 - Internal TPM counter continues in Doze mode.
 * - 1 - Internal TPM counter is paused and does not increment during Doze mode.
 *     Trigger inputs and input capture events are also ignored.
 */
/*@{*/
#define BP_TPM_CONF_DOZEEN   (5U)          /*!< Bit position for TPM_CONF_DOZEEN. */
#define BM_TPM_CONF_DOZEEN   (0x00000020U) /*!< Bit mask for TPM_CONF_DOZEEN. */
#define BS_TPM_CONF_DOZEEN   (1U)          /*!< Bit field size in bits for TPM_CONF_DOZEEN. */

/*! @brief Read current value of the TPM_CONF_DOZEEN field. */
#define BR_TPM_CONF_DOZEEN(x) (BME_UBFX32(HW_TPM_CONF_ADDR(x), BP_TPM_CONF_DOZEEN, BS_TPM_CONF_DOZEEN))

/*! @brief Format value for bitfield TPM_CONF_DOZEEN. */
#define BF_TPM_CONF_DOZEEN(v) ((uint32_t)((uint32_t)(v) << BP_TPM_CONF_DOZEEN) & BM_TPM_CONF_DOZEEN)

/*! @brief Set the DOZEEN field to a new value. */
#define BW_TPM_CONF_DOZEEN(x, v) (BME_BFI32(HW_TPM_CONF_ADDR(x), ((uint32_t)(v) << BP_TPM_CONF_DOZEEN), BP_TPM_CONF_DOZEEN, 1))
/*@}*/

/*!
 * @name Register TPM_CONF, field DBGMODE[7:6] (RW)
 *
 * Configures the TPM behavior in debug mode. All other configurations are
 * reserved.
 *
 * Values:
 * - 00 - TPM counter is paused and does not increment during debug mode.
 *     Trigger inputs and input capture events are also ignored.
 * - 11 - TPM counter continues in debug mode.
 */
/*@{*/
#define BP_TPM_CONF_DBGMODE  (6U)          /*!< Bit position for TPM_CONF_DBGMODE. */
#define BM_TPM_CONF_DBGMODE  (0x000000C0U) /*!< Bit mask for TPM_CONF_DBGMODE. */
#define BS_TPM_CONF_DBGMODE  (2U)          /*!< Bit field size in bits for TPM_CONF_DBGMODE. */

/*! @brief Read current value of the TPM_CONF_DBGMODE field. */
#define BR_TPM_CONF_DBGMODE(x) (BME_UBFX32(HW_TPM_CONF_ADDR(x), BP_TPM_CONF_DBGMODE, BS_TPM_CONF_DBGMODE))

